<?php
return [
	/*
    |--------------------------------------------------------------------------
    | Regex/Pattern related config
    |--------------------------------------------------------------------------
    |    
    | Usage: config('regex.pattern').
    |
    |
    | Notes:
    |	base64 - based from https://stackoverflow.com/questions/475074/regex-to-parse-or-validate-base64-data#answer-5885097
    */

	'valid_text' => '/^[^<>\x01-\x1F]*$/',
	'valid_user_name' =>
		"/^[\w `´’'‘ÆÐƎƏƐƔĲŊŒẞÞǷȜæðǝəɛɣĳŋœĸſßþƿȝĄƁÇĐƊĘĦĮƘŁØƠŞȘŢȚŦŲƯY̨Ƴąɓçđɗęħįƙłøơşșţțŧųưy̨ƴÁÀÂÄǍĂĀÃÅǺĄÆǼǢƁĆĊĈČÇĎḌĐƊÐÉÈĖÊËĚĔĒĘẸƎƏƐĠĜǦĞĢƔáàâäǎăāãåǻąæǽǣɓćċĉčçďḍđɗðéèėêëěĕēęẹǝəɛġĝǧğģɣĤḤĦIÍÌİÎÏǏĬĪĨĮỊĲĴĶƘĹĻŁĽĿʼNŃN̈ŇÑŅŊÓÒÔÖǑŎŌÕŐỌØǾƠŒĥḥħıíìiîïǐĭīĩįịĳĵķƙĸĺļłľŀŉńn̈ňñņŋóòôöǒŏōõőọøǿơœŔŘŖŚŜŠŞȘṢẞŤŢṬŦÞÚÙÛÜǓŬŪŨŰŮŲỤƯẂẀŴẄǷÝỲŶŸȲỸƳŹŻŽẒŕřŗſśŝšşșṣßťţṭŧþúùûüǔŭūũűůųụưẃẁŵẅƿýỳŷÿȳỹƴźżžẓ-]+$/",
	'valid_email' => '/^[a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+.[a-zA-Z0-9-.]+$/',
	'valid_subject_name' =>
		//"/^[\w_ ’'‘ÆÐƎƏƐƔĲŊŒẞÞǷȜæðǝəɛɣĳŋœĸſßþƿȝĄƁÇĐƊĘĦĮƘŁØƠŞȘŢȚŦŲƯY̨Ƴąɓçđɗęħįƙłøơşșţțŧųưy̨ƴÁÀÂÄǍĂĀÃÅǺĄÆǼǢƁĆĊĈČÇĎḌĐƊÐÉÈĖÊËĚĔĒĘẸƎƏƐĠĜǦĞĢƔáàâäǎăāãåǻąæǽǣɓćċĉčçďḍđɗðéèėêëěĕēęẹǝəɛġĝǧğģɣĤḤĦIÍÌİÎÏǏĬĪĨĮỊĲĴĶƘĹĻŁĽĿʼNŃN̈ŇÑŅŊÓÒÔÖǑŎŌÕŐỌØǾƠŒĥḥħıíìiîïǐĭīĩįịĳĵķƙĸĺļłľŀŉńn̈ňñņŋóòôöǒŏōõőọøǿơœŔŘŖŚŜŠŞȘṢẞŤŢṬŦÞÚÙÛÜǓŬŪŨŰŮŲỤƯẂẀŴẄǷÝỲŶŸȲỸƳŹŻŽẒŕřŗſśŝšşșṣßťţṭŧþúùûüǔŭūũűůųụưẃẁŵẅƿýỳŷÿȳỹƴźżžẓ\\\/|-]*$/i",
		"/^[^<>\x01-\x08\x0E-\x1F]*$/",
	'valid_region' => "/^[^<>\x01-\x08\x0E-\x1F]*$/",
	'valid_ref' => '/^[a-z0-9_]+$/',
	'valid_voucher_code' => '/^[A-Z0-9]+$/',
	'friendly_voucher_code' => '/[^a-zA-Z0-9]+/',
	'valid_handle' => '/^[a-zA-Z0-9_]+$/',
	'valid_callback' => '/^[a-z_]+[a-z_0-9]+$/i',
	'valid_client' => '/^[\w.-]+$/',
	'valid_version' => '/^[\w.\+-]+$/',
	'valid_rating' => '/^[0-1]?(\.[0-9]+)?$/',
	'valid_parker_val' => '/^([0-9]{1,3})?(\.[0-9]+)?$/',
	'valid_price' => '/^([0-9]{1,13})?(\.[0-9]{1,4})?$/',
	'non_print' => '/[\x01-\x1F]/',
	'non_print_or_tags' => '/[<>\x01-\x1F]/',
	'valid_long_text' => "/^[^<>\x01-\x08\x0E-\x1F]*$/",
	'sha256' => '/^[A-Fa-f0-9]{64}$/',
	'base64' =>
		'/^(?:[A-Za-z0-9+\/]{4})*(?:[A-Za-z0-9+\/]{2}==|[A-Za-z0-9+\/]{3}=|[A-Za-z0-9+\/]{4})$/',
	'valid_latitude' =>
		'/^(\+|-)?((\d((\.)|\.\d{1,6})?)|(0*?[0-8]\d((\.)|\.\d{1,13})?)|(0*?90((\.)|\.0{1,6})?))$/',
	'valid_longitude' =>
		'/^(\+|-)?((\d((\.)|\.\d{1,6})?)|(0*?\d\d((\.)|\.\d{1,6})?)|(0*?1[0-7]\d((\.)|\.\d{1,13})?)|(0*?180((\.)|\.0{1,6})?))$/',
	'valid_phone_prefix' => '/^(([+]|[0])?[1-9])\d*$/',
	'valid_phone' => '/^([+])?\d*$/',
	'valid_client_host' =>
		'/^https?:\/\/(\w[\w\d.-]+)?(noteable\.co|ntbl\.link|localhost|127.0.0.1)(:\d+)?$/',
	'valid_fkey' => '/^[a-zA-Z\d_:.-]{0,127}$/',
];
